import image1 from "../images/image_1_1.png";
import image2 from "../images/image_1_2.png";
import image3 from "../images/image_1_3.png";
import image4 from "../images/image_1_4.png";
import image5 from "../images/image_1_5.png";
import image6 from "../images/image_1_6.png";
import image7 from "../images/image_1_7.png";
import image8 from "../images/image_1_8.png";

const unit_one = (
  <div>
    <u className="text-red text-bold text-large text-center">
      الموديول الأول: خلفية نظرية عن ماهية الواقع المعزز
    </u>
    <br />
    <div className="text-red text-bold">Augmented Reality مفهوم الواقع المعزز :</div>
    <br />
    <div className="text-center">
      <img src={image1} alt="" width="30%"/>
    </div>
    <br />
    <div>
    تعددت تعريفات الواقع المعزز منها أنه :
    <ul>
      <li>تكنولوجيا ثلاثية الأبعاد تدمج بين الواقع الحقيقي والواقع الافتراضي، أي بين الكائن الحقيقي والكائن الافتراضي، ويتم التفاعل معها في الوقت الحقيقي، أثناء أداء المتعلم للمهمة الحقيقية.</li>
      <li>عرض مركب يدمج بين المشهد الحقيقي الذي يراه المستخدم والمشهد الإفتراضي المولد بالكمبيوتر؛ والذي يثري المشهد بمعلومات إضافية، فيشعر المستخدم أنه يتفاعل مع العالم الحقيقي وليس الظاهري، بهدف تحسين الإدراك الحسي للمستخدم.</li>
      <li>تعزيز القدرة المعرفية للمستخدم عن طريق عرض كائنات إفتراضية على شاشة يعرض عليها  أيضًا صور واقعية يتم التقاطها بواسطة الكاميرا و تعرض الكائنات الافتراضية في الوقت الحقيقي في صورة يُمكن أن يتفاعل معها المستخدم .</li>
      <li> التقنية التي يتم فيها دمـج الواقـع بمعـززات افتراضية بوسائط متعددة -  كالصور ثنائية أو ثلاثية الأبعاد أو المؤثرات الصوتية والمرئية-  لخلق بيئة تعليمية افتراضية شبه واقعية توفر معلومات إضافية أو تكون بمثابة موجه له</li>
      <li>تقنية تساعد على المزج المتزامن بين العالم الحقيقي الملموس والعالم االفتراضي، بإضافة عناصر افتراضية قد تكون ثلاثية الأبعاد (3D)  او ثنائية الأبعاد(2D إلى البيئة الحقيقية لتحقق عملية التعزيز على تجربة المستخدم وتساعد على توفير فرص تعلم محسنة من خلال استشعار البيئة الحقيقية ومعالجة البيانات لتطبيق العناصر الإفتراضية في الوقت الحقيقي، مما يتيح للمستخدمين تجربة تفاعلية تمزج بين العالمين الواقعي والإفتراضي، وتساهم في توصيل المحتوى والعمل على زيادة التفاعل بين الطالب والمحتوى التعليمي</li>
      <li>مزج المعلومات الرقمية والمادية في الوقت الحقيقي من خلال الأجهزة التقنية المختلفة، وبعبارة أخرى: هو يتمثل في استخدام مجموعة من الأجهزة التقنية التي تضيف معلومات افتراضية إلى معلومات مادية، أي هو إضافة جزء افتراضي إلى ما هو حقيقي، مما يجعل المتعلمين يتفاعلون مع المحتوى الرقمي ويستطيعون تذكره بصورة أفضل</li>
    </ul>
    <br/><br/><br/>
    

    من العرض السابق لمفهوم الواقع المعزز يُمكن استخلاص مايلي: 
    <ul>
      <li>تكنولوجيا تفاعلية تشاركية تزامنية تستخدم الأجهزة الذكية لإضافة بيانات رقمية للواقع الحقيقي على هيئة ( صور ، وسائط ، مقاطع فيديو ، روابط ) بأشكال متعددة الأبعاد.</li>
      <li>تقنية تمزج بين المشهد الحقيقي و المشهد الرقمي من خلال إضافة الكائنات الإفتراضية إلى البيئة الحقيقية</li>
      <li>تعزيز بصري باستخدام الأشكال ثنائية الأبعاد وثلاثية الأبعاد يسمح بالتفاعل في الوقت الحقيقي </li>
      <li>يزيد من فعالية التعلم حيث ينتقل المتعلم إلى عالم المعلومات ليختبر أسسها ومسبباتها بنفسه في خبرة واقعية محفزة ومشوقة بدلًا من التعامل مع هذه المعلومات في قالب نصي ثابت . </li>
    </ul>
    </div>
    <br />

    <br />
    <div className="text-red text-bold">خصائص الواقع المعزز :</div>
    <br />
    <div className="text-center">
      <img src={image2} alt="" width="30%"/>
      <img src={image3} alt="" width="30%"/>
    </div>
    <br />
    <div>
    <ul>
      <li>الدمج: حيث يتم الجمع بين العناصر الحقيقية و الافتراضية و يتمثل هدف الواقع المعزز في دمج البيانات الرقمية بدقة مع البيئة الواقعية من اجل تزويد المستخدمين بالخبرة الحسية الفائقة من خلال عرض الخصائص الحسية مع مراعاة شمولية المعلومات المعززة عن المواد الحقيقية وذلك بتزامن الصوت والصورة في الواقع الافتراضي مع الواقع الحقيقي، ومن ثم يُمكن اكتساب مستويات مختلفة من الخبرة الحسية .</li>
      <li>في الواقع المعزز تكون واجهة التفاعل هي البيئة الحقيقية ونتفاعل معه في الوقت الحقيقي.بحيث يشعر المتعلم بأنه يتفاعل مع العالم الحقيقي وليس الظاهري</li>
      <li>يمكن استخدام الواقع المعزز من خلال أجهزة بسيطة مثل الحاسوب أو جهاز الهاتف المحمول.</li>
      <li>التفاعل الفوري بين المواد الحقيقية والإفتراضية لتزويد المتعلم بالخبرة الحسية، ويتم ذلك التفاعل في ثلاث صور المتعلم والمحتوى، المتعلم والوسائل التعليمية، المتعلمين وبعضهم، لمساعدة المتعلمين على حل المشكلة عن طريق التعاون العمل الجماعي بفاعلية وسهولة. .</li>
      <li>البساطة : من خلال تزويد المتعلم بمعلومات واضحة وموجزة ؛ مما يؤثر إيجابيًا على استيعابهم </li>
      <li>التمكين : تمكن المعلم من إدخال معلوماته و بياناته و إيصالها بطريقة سهلة ، كما تمكن المتعلم من التفاعل مع المحتوى المعزز و إعطاء ردود فعل متتوعة.</li>
      <li>الشفافية : يجعل إجراءات التعلم بين المعلم و المتعلم شفافة وواضحة .</li>
      <li>المشاركة: يعزز المشاركة بين المتعلمين بعضهم البعض، وينمي مهارات التفاعل الاجتماعي لديهم .</li>
      <li>تقديم محتوى ثلاثي الأبعاد : حيث يتم إتاحة كائنات ثلاثية الأبعاد بحيـث تنـدمج مـع الكائنات الحقيقية التي تسهم في تعزيز عملية التعلم</li>
      <li>سهولة الوصول : حيث يسهل الوصول للكائنات الافتراضية المعززة للكائنات الحقيقـة في أي مكان وفي أي زمان توجد فيه شبكة، حيث يتيح المعلومات في أى وقت و أى مكان </li>
      <li>المرونة: حيث يمكن للمتعلمين من التفاعل مع تكنولوجيا الواقع المعزز والحصول على المعلومات  من أي مكان</li>
      <li>سهولة الاستخدام : لا يحتاج استخدام تكنولوجيا الواقع المعزز لأي مهـارات حاسـوبية أو مهارات خاصة. </li>
      <li>قابلية للتطوير وللتوسع بسهولة وباستمرا و بتكلفة منخفضة ، ويمكن ربطه بأدوات تقييم </li>
      <li>تعزيز الإدراك الحسي للمتعلم واستيعابه من خلال تفاعله مع المحتوى والاستعانة بمجموعة من التقنيات والأدوات التي تضيف معلومات إلى الواقع الفعلي </li>
      <li>يمد المتعلم بمعلومات واضحة ودقيقة يصعب إيضاحها في التعلم التقليدي مما يزيد من دافعيته للتعلم</li>
      <li>متعدد الأبعاد. </li>
      <li>يتيح التحكم والممارسة من قبل المتعلم مما يجعل التعلم أبقى أثرًا .</li>
      <li>تستخدم التقنية لنقل البيئة الخارجية إلى داخل الأجهزة الذكية.</li>
    </ul>
    <br/><br/><br/>

    </div>

    <br />
    <div className="text-red text-bold">أنواع الواقع المعزز :</div>
    <br />
    <div className="text-center">
      <img src={image4} alt="" width="30%"/>
    </div>
    <br />
    <div>
      <ul>
        <li>الواقع المعزز المستند إلى العلامات   Marker- based AR أو التتبع المعتمد على العلامات  Markers tracking   أو تقنية استخدام العلامات، وهذا النوع يقوم على الرؤية من خلال الكمبيوتر أو الهاتف المحمول لشكل أو علامة يقرؤها الكمبيوتر من خلال الكاميرا حيث تستطيع التقاطها وتمييزها لاستدعاء و عرض المعلومات الافتراضية المرتبطة بها، وفي هذه الحالة يسمى الواقع المعزز القائم على العلامة ، حيث تستخدم تطبيقات الواقع المعزز العلامات كنقاط استدلال توضع بشكل مصطنع في البيئة الواقعية التي يمكن لبرمجيات الرؤية الكمبيوترية  (التطبيق ) التعرف عليها بسهولة و تسمى تلك النقاط الاستدلالية علامات أو رموز و العلامات يجب أن تكون فريدة غير متماثلة داخل تطبيق الواقع المعزز مثل QR رمز الاستجابة السريعة ويمكن أن تعرض على ورق أو على شاشة الكمبيوتر، ويعتمد هذا النوع على التعرف على الشكل Recognition  عـن طريـق الزوايا، والحدود والانحناءات الخاصة به، وذلك لتوفير معلومات إضافية إلى الشكل الموجود أمامه في الواقع الحقيقي. </li>
        <li>الواقع المعزز غير المستند إلى العلامات   Marker-less AR  ، وتعتمد على التتبع بدون علامات، إنما يتم الاستعانة بموقع الكاميرا الجغرافي (GPS )أو ببرامج تمييز الصورة  (Recognation Image)   لعرض المعلومات، ويطلق عليه الواقع المعزز القائم على الصورة. </li>
        <li>الواقع المعززالمستند إلى الموقع   Location- based AR  أو الواقع المعزز الواعي بالمكان (Location-aware) الذي لا يستخدم علامات (Markerless)، إنما يستعين بموقع الكاميرا الجغرافي عن طريق خدمة تحديد المواقع العالمية (GPS). فيعتمد على هواتف ذكية مزودة بنظام تحديد المواقع العالمي (GPS)، ويتم تنشيط وسائط الواقع المعزز استنادا إلى الموقع على (GPS) لعرض المعلومات</li>
        <li>الواقع المعزز المتراكب Superimposed AR  : وتتميز طريقة التراكب في الواقع المعزز بوضع صورة رقمية على كائن فعلي، مما يؤدي عادةً إلى تغيير ملموس للكائن ، ويستند إلى التخطيط أو موضع ظهور الكائنات الافتراضية سواء ثنائية او ثلاثية الابعاد يتم من خلال خصائصها الهندسية ( الموضع ، الاتجاه ، الحجم ، ..) و هو : </li>
        <li>التحسين : فالتحسين هو تعزيز الواقع بإضافات افتراضية تكمل الشكل </li>
        <li>الإحلال : و هو أن تظهر الصورة الافتراضية على الصورة الحقيقية و تخفيها </li>
        <li>التجاور : و هو وضع الكائن الافتراضي بالقرب أو على مسافة من الكائن الحقيقي بهدف التكامل بينهما في المعنى .</li>
        <li>الواقع المعزز الإسقاطي  projection-assisted AR: يتم إسقاط المعلومات البصرية مباشرة على الأشياء  المادية لتعزيزها، ويتطلب كاميرا لعرض الأشياء المعززة عن طريق استخدام الكاميرا الخلفية لتصوير محيطات العالم الحقيقي، والشاشة الأمامية لعرض التعزيزات مثل المعلومات التي تم إلقاء الضوء عليها من قبل علامات الواقع المعزز، ويُعد من أكثر أنواع الواقع المعزز شيوعًا  واستخدامًا ويعتمد على استخدام الصور الإصطناعية وإسقاطها على الواقع الفعلي لزيادة نسبة التفاصيل التى يراها المتعلم من خلال الأجهزة، وأكثر المجالات استخداما لهذا النوع هي : تصوير سير العمليات فى الأجهزة، والمكونات التقنية التى تحتاج الى توضيح عملي يسهل إداركها، ودون وجود هذا لا يتحقق بشكل علمي مناظر للواقع الدارسي لمحتوى المقرارت وخاصة مهارات تطوير عناصر التعلم الرقمية ، حيث تتطلب هذه المهارات دقة في آدائها وتوضيح مجالات التمثيل البصري لها.</li>
        <li>الواقع المعزز المعتمد على الخطوط outlining AR : وتعتمد هذه الطريقة على الدمج بين الواقع المعزز والواقع الافتراضـي حيث تمكن الفرد مثلًا من الدمج بين الخطوط العريضة من جسمه وجسم آخر افتراضي، مما تتيح له الفرصة للتعامل أو لمس أو التقاط أجسام وهمية غير واقعية وهى موجودة بكثرة من المتاحف والمراكز العلمية التعليمية</li>
      </ul>
    <br/><br/><br/>
    </div>

    <br />
    <div className="text-red text-bold">آلية عمل الواقع المعزز</div>
    <br />
    <div className="text-center">
      <img src={image5} alt="" width="30%"/>
    </div>
    <br />
    <div>
    تعتمد تقنية الواقع المعزز على قيام النظام بربط الواقع الحقيقي بالعنصر الافتراضي المناسب له والمخزن مسبقا في ذاكرته، كالمعلومات التي تعزز الواقع الحقيقي. وتعتمد برمجيات الواقع المعزز على استخدام كاميرا الهاتف المحمول أو الكمبيوتر اللوحي لرؤية الواقع الحقيقي، ثم تحليله تبعا لما هو مطلوب من البرنامج والعمل على دمج العناصر الافتراضية فيه في نفس السياق ويتم ذلك من خلال المراحل التالية : 
      <ul>
        <li>تقسيم الصورة: يتم فيها فصل الواجهة الأمامية للكائنات عن خلفيتها، ويمكن عمل ذلك باستخدام أساليب قياس الأبعاد وتحدد درجة جودة عملية الفصل مدى نجاح عملية استخراج الكائنات من الصورة. </li>
        <li>الإستخراج: يعنى إيجاد العناصر المعروفة على الصورة، وهذه العناصر تتكون من  أساسًا من  أركان وخطوط وأشكال ومنحنيات، وتتألف هذه المرحلة من مراحل ثانوية تبدأ باستكشاف الأركان ثم الحواف ذات الصلة وأخيرا كشف وإحاطة مربع العلامة</li>
        <li>إستكشاف العلامة: يجب تصميم العلامة الحقيقية بطريقة تجعل من السهل استكشافها لتكون فريدة بشكل كاٍف؛ ليسهل التعرف عليها من بين العلامات الأخرى، حتى يتيسر تحديد هويتها، وتخصيص هذه المرحلة بإيجاد موقع كل خلية على الصورة، ولأن أركان العلامة متوفرة أصبحت مسألة رسم مربع أو شكل رباعي الأضلاع أبسط. </li>
        <li>توجيه الكاميرا: بمجرد أن يتم تحديد العلامة بنجاح تكون الخطوة الأخيرة في هذه العملية وتحديد موقع العلامة في الحيز المكاني؛لأن الكائنات المدمجة سيتم تجسيدها على الصورة؛ ليتناسب نطاقها واتجاهاتها مع العالمة المكتشفة.</li>
        <li>الدمج: الهدف من هذه المرحلة تجسيد الكائنات ثلاثية الأبعاد التي سيتم وضعها وإدراجها على العلامة داخل المشهد، كما يتم إجراء بعض الأشياء الإضافية في هذه المرحلة مثل: جودة التجسيد، ورسوم الظل والإضاءة. </li>
        <li>تشغيل ومشاهدة تطبيق الواقع المعزز البد من تحميل التطبيق المخصص لتقنية تصميم الواقع المعزز (العلامة/ الصورة) ثم توجيه الكاميرا للبيئة الواقعية المراد تعزيزها ستظهر الكائنات الرقمية الإفتراضية المرتبطة بها والتي يتم التفاعل المباشر معها.</li>
      </ul>
    <br/><br/><br/>
    </div>

    <br />
    <div className="text-red text-bold">أهمية توظيف الواقع المعزز في  العملية التعليمية:</div>
    <br />
    <div className="text-center">
      <img src={image6} alt="" width="30%"/>
      <img src={image7} alt="" width="30%"/>
    </div>
    <br />
    <div>
      <ul>
        <li>يوفر محتوى تعليميا غنيا، ويساعد على فهم المحتوى.</li>
        <li>يعزز التعلم التعاوني بين المتعلمين، حيث يُمكنهم من العمل مًعا على مشروعات تعليمية والتفاعل بشكل مشترك في بيئات افتراضية.</li>
        <li>يوفر بيئة آمنة للمتعلمين لممارسة المهارات وتطبيق التجارب.</li>
        <li>أداة داعمة لتطبيق نظريات التعلم بطرق مشوقة ومثيرة للاهتمام.</li>
        <li>يوفر خبرات تعليمية يصعب الوصول إليها في نفس الموقع التعليمي مثل الفضاء.</li>
        <li>إثارة التفكير الإبداعي لدى المتعلمين، وذلك عن طريق دمج مواد التعليم الرقمية مباشرة مع البيئة المادية وتحسين فهمهم لمجالات المواد الدراسية المجردة.</li>
        <li>تعزيز التفاعل الاجتماعي بين المشاركين في نفس البيئة التعليمية.</li>
        <li>يجعل بيئات التعلم تفاعلية جذابة وممتعة.</li>
        <li>تبسيط المفاهيم المعقدة فهو يستخدم لشرح وتوضيح المفاهيم الصعبة من خلال تقديم  تصور بصري للمفاهيم النظرية الصعبة ، مما يجعلها أكثر فهًما للطالب .</li>
        <li>يساعد على الاستكشاف العملي للنظرية من خلال أمثلة ملموسة.</li>
        <li>إثارة دافعية المتعلمين، وجذب انتباههم وتشويقهم للتعلم من خلال تفعيل الحواس.</li>
        <li>يراعي الفروق الفردية، لأنه يتيح فرصة لمشاهدة الأشكال من جوانب مختلفة، ومرات متعددة.</li>
        <li>يشجع المتعلمين على اكتشاف المعلومات والتفاعل معها من خلال المشاركة في الأنشطة </li>
        <li>إمكانية تقديم الخبرات التعليمية من خلال نماذج وأشكال ثلاثية الأبعاد (3D)، حيث يتمكن المتعلم من مشاهدة وتحليل الموضوعات من جوانب مختلفة، وهذا يعطي فهما أعمق، ويقدم صورة ذهنية صحيحة وشاملة للخبرات التعليمية.</li>
        <li>تعزيز المشاركة والتفاعل: يساعد الواقع المعزز في تحفيز المشاركة الفعّالة للطالب من خلال تجارب تعليمية تدعم التفاعل.</li>
        <li>يشجع الطالب على التعلم النشط والمساعدة على المعرفة من خلال تفاعل الطالب مع المحتوى التعليمي التفاعلي.</li>
        <li>توفير تجارب واقعية للتعليم: يساعد الطالب على التفاعل مع الأشياء والمقررات بطريقة متطابقة مع الواقع بدون الحاجة إلى التواجد الفعلي في المكان.</li>
        <li>توفير تعليم مخصص: يساعد المعلمين من خلال تصميم تجارب تعليمية تلبي احتياجات ومستوى الفهم لكل طالب.</li>
        <li>يزيد من قدرة الطالب على استيعاب وتطبيق المعرفة بفعالية</li>
        <li>يعزز من فرص التعلم مدى الحياة والتطوير المهني.</li>
        <li>يساعد الطالب على اكتساب مهارات جديدة تزيد من قدرته على التكيف مع التكنولوجيا الحديثة في مجالات مختلفة.</li>
        <li>يُحسن جودة التعليم ويزيد من مشاركة الطالب وفهمه للمفاهيم التعليمية </li>
        <li>يعوض قلة الموارد في التعليم، ويقلل التكلفة .</li>
        <li>تقليل الحمل المعرفي وتعزيز دافعية التعلم والحفظ على المدى الطويل للمتعلمين</li>
        <li>دعم المتعلمين في أداء الواجبات المنزلية</li>
        <li>يساعد الواقع المعزز الطالب في تعليم المواد المدرسية التي لا يمكن للطالب لمسها أو إدراكها بسهولة إلا من خلال تجربة حقيقية مباشرة</li>
      </ul>
    <br/><br/><br/>
    </div>

    <br />
    <div className="text-red text-bold">مكونات الواقع المعزز :</div>
    <br />
    <div className="text-center">
      <img src={image8} alt="" width="30%"/>
    </div>
    <br />
    <div>
      يتكون الواقع المعزز من المكونات التالية : 
      <ol>
        <li>تطبيق الواقع المعزز : وهو برنامج كمبيوتري يتحكم في جميع جوانب تجربة الواقع المعزز ، فعلى سبيل المثال : يحمل المستخدم تطبيق الواقع المعزز الذي يمكن من خلاله استشعار العلامة ( الباركود) و التي تكون مرتبطة بمعلومات افتراضية على قاعدة بيانات نظام الواقع المعزز. </li>
        <li>المحتوى: ويتضمن الكائنات - سواء صوت أو العناصر المرئية الأخرى (النص ، صورثابتة  ثنائية الأبعاد ، أو ثلاثية الأبعاد ، الصور المتحركة ومقاطع الفيديو و غيرها ) -  التي سيتم عرضها على الشاشة  .</li>
        <li>التفاعل : يجب أن تكون كل تجربة واقع معزز تفاعلية بطريقة أو بأخرى بحيث يسمح للمشارك بمشاهدة أو إدراك العالم من وجهات نظر مادية مختلفة ، بالإضافة إلى هذا التفاعل الأساسي يمكن للمشاركين التفاعل مع التجربة عن طريق الضغط على الأزرار أو القيام بحركات جسدية أو عن طريق التحدث بأوامر أو بأي عدد من الأجراءات المختلفة .</li>
        <li>(المشاركون): يحدث إدراك الواقع المعزز في ذهن واحد أو أكثر من المشاركين ، وفي الواقع يتمثل دور تقنية الواقع المعزز في توفير محفزات مصطنعة تجعل المشارك يعتقد أن شيئًا ما يحدث بالفعل ، ويلعب المشارك ( المشاركون ) دورًا نشطًا فيما يحدث في تجربة الواقع المعزز حيث تؤثر جميع حركاتهم و أفعالهم و أنشطتهم على كيفية استجابة النظام .</li>
        <li>كاميرا الواقع المعزز : حيث تلتقط الكاميرا المشهد الحقيقي ، ويتم التعرف عليه من قاعدة البيانات ، ثم يظهر الكائن المرتبط به سواء كان ثلاثي الأبعاد أو ثنائي الأبعاد </li>
        <li>متتبع المسار للواقع المعزز أو متتبع الكائنات أو نمط الاستشعار: فعند التعرف على العنصر المادي في مجال رؤية الكمبيوتر؛ يتم استدعاء الكائنات المرتبطة به  الموجودة في قاعدة البايانات.</li>
        <li>واجهة تفاعل الواقع المعزز : تشتمل على الأدوات التي يتم من خلالها تحميل صورة الكائن الحقيقي التي يقوم بالتقاطها على نظام الواقع المعزز؛  ليتم من خلاله البحث عن الكائن الافتراضي </li>
      </ol>
    <br/><br/><br/>
    </div>
  </div>
)

export default unit_one
