import image1 from "../images/image_3_1.png";
import image2 from "../images/image_3_2.png";
import image3 from "../images/image_3_3.png";
import image4 from "../images/image_3_4.png";
import image5 from "../images/image_3_5.png";

const unit_three = (
  <div>
    <u className="text-red text-bold text-large text-center">
      الموديول الثالث: مراحل تطوير الواقع المعزز
    </u>
    <p>مراحل تطوير الواقع المعزز: سيتم تطوير الواقع المعزز في العلوم وفق النموذج العام للتصميم التعليمي ADDIE، والذي يتكون من خمس مراحل أساسية، هى: التحليل Analysis، التصميم Design، التطوير Development، التنفيذ Implementation، والتقويم Evaluation، وفيما يلى عرض لإجراءات تطوير الواقع المعزز وفقًا لمراحل نموذج التصميم العام ADDIE:</p>
    <div className="text-center">
      <img src={image1} alt="" width="50%"/>
    </div>
    <h4>• المرحلة الأولي: مرحلة التحليل:</h4>
    <p>تهدف هذه المرحلة إلى تحديد الحاجات التعليمية والأهداف العامة للواقع المعزز، وتحديد المهام التعليمية ومحتوى التعلم، والتعرف على خصائص المتعلمين وتحليل الموارد وبيئة التعلم حتى يتم التمهيد لتصميمها، وإنتاجها، وتتضمن الإجرءات الآتية:</p>
    <div className="text-center">
      <img src={image2} alt="" width="50%"/>
    </div>
    <h5>• تحديد الحاجات التعليمية لتطوير الواقع المعزز:</h5>
    <p>يهدف هذا الإجراء إلى تحديد الحاجات التعليمية لتطوير الواقع المعزز. الحاجة: هى الفجوة بين مستوى الأداء الحالى للمتعلم، ومستوى الأداء المطلوب، وتهدف هذه العملية إلى تحديد الحاجات التعليمية، وصياغاتها فى شكل أهداف عامة للواقع المعزز.</p>

    <h5>• تحديد الأهداف العامة:</h5>
    <p>يهدف هذا الإجراء إلى تحديد الأهداف العامة للواقع المعزز، والتي من خلالها يتم تحديد الغايات من استخدامه. فالهدف العام: هو أهداف تتميز بالعمومية والتجريد، ويمكن تحليلها إلى أهداف أكثر تخصيصاً.</p>
    <p>شروط صياغة الأهداف العامة:</p>
    <ul>
        <li>واسعة وغير محددة وتعكس الرؤية العامة لتصميم الواقع المعزز.</li>
        <li>الهدف العام يتم تحقيقه على المدى البعيد بعد دراسة المتعلم لمحتوى الواقع المعزز، ولا يمكن قياسه.</li>
    </ul>
    <p>من أمثلة الأهداف العامة:</p>
    <ul>
        <li>أن يدرك المتعلم موضوع أجهزة جسم الإنسان بالواقع المعزز.</li>
        <li>أن يلم المتعلم بموضوع أجهزة جسم الإنسان بالواقع المعزز.</li>
    </ul>

    <h5>• تحليل خصائص الفئة المستهدفة:</h5>
    <p>يهدف هذا الإجراء إلى تحليل خصائص الفئة المستهدفة ومهاراتهم المعلوماتية والمعرفية، والوجدانية وسلوكهم المدخلي؛ حيث يتم تحليل خصائص الفئة المستهدفة أي تحديد المعارف والمهارات التى يمتلكها الطلاب بالفعل قبل بدء استخدامهم للواقع المعزز.</p>

    <h5>• تحليل بيئة التعلم والموارد والمصادر المتاحة:</h5>
    <p>يهدف هذا الإجراء إلى الإطلاع الميداني من حيث توفر الإنترنت، والأجهزة التعليمية، وتحليل المصادر الرقمية وكائنات التعلم المتاحة، والمعوقات والمحددات.</p>

    <h4>• المرحلة الثانية: مرحلة التصميم:</h4>
    <p>تهدف هذه المرحلة إلى صياغة الأهداف التعليمة للواقع المعزز، واختيار المحتوى التعليمي وتنظيمه، وتتضمن الإجرءات الآتية:</p>
    <div className="text-center">
      <img src={image3} alt="" width="50%"/>
    </div>
    <h5>• صياغة الأهداف التعليمية:</h5>
    <p>حيث يتم تحديد أهداف استخدام الواقع المعزز في الجوانب المعرفية، والمهارية، والوجدانية.</p>
    <p>• مفهوم الأهداف التعليمية: تعرف الأهداف التعليمية بأنها: عبارة تصف التغير المرغوب في سلوك المتعلم – معرفيًا، أو مهاريًا أو وجدانيًا – بعد مروره بخبرة تعليمية معينة؛ بحيث يكون هذا التغير قابل للملاحظة والقياس.</p>
    <p>• شروط صياغة الأهداف التعليمية: من شروط صياغة الأهداف التعليمية ما يلى:</p>
    <ul>
        <li>التحديد والتعريف للسلوك أو الأداء المتوقع قيام المتعلم به بعد عملية التعلم والذى يعد دليلاً على تحقيق الهدف.</li>
        <li>يصاغ الهدف بشكل يجعله قابلاً للقياس والملاحظة.</li>
        <li>يصاغ الهدف التعليمي بشكل يعكس ناتج التعليم وليس عملية التعلم ذاتها أو موضوع التعلم.</li>
        <li>أن يشتمل الهدف على ناتج تعليمى واحد.</li>
        <li>صياغة أهداف متنوعة فى مستوياتها التعليمية العقلية.</li>
        <li>أن يشتمل كل هدف تعليمي على العناصر التالية: (السلوك، المحتوى التعليمى، شروط الأداء، معيار الأداء ومستوى الأداء المتوقع).</li>
    </ul>
    <p>من أمثلة الأهداف التعليمية:</p>
    <ul>
        <li>أن يُحدد المتعلم مكونات الجهاز الهضمي بالواقع المعزز.</li>
        <li>أن يُميز المتعلم بين مكونات الجهاز الهضمي بالواقع المعزز.</li>
    </ul>

    <h5>• اختيار المحتوى التعليمي وتنظيمه:</h5>
    <p>من خلال تحديد عناصر المحتوى اللازم لتحقيق الأهداف التعليمية، وتنظيمها بالتتابع الذي يؤدي إلى تحقيق الأهداف بما يتناسب وخصائص المتعلم ونمط تعلمه مع مراعاة أن:</p>
    <ul>
        <li>يكون المحتوى مرن يمكن للمعلم تكييفه حسب حاجات المتعلمين.</li>
        <li>ينظم محتوى التعلم في ضوء الأهداف المحددة.</li>
        <li>تنظم الأدوات والتطبيقات والوسائط الرقمية المعززة للعملية التعليمية.</li>
        <li>يتيح الاستكشاف الموجه لزيادة الاستفادة.</li>
        <li>ينظم وفق جدول زمنى للاستخدام.</li>
    </ul>
    <p>• تصميم نمط التفاعل: حيث يُحدد - طبقًا لقدرات المتعلمين وخبراتهم باستخدام الكمبيوتر، وتطبيقاته - نمط التفاعل بين المتعلم والواقع المعزز، ومستويات هذا التفاعل وأساليب تنفيذه، مع مراعاة ما يلي:</p>
    <ul>
        <li>يكون بسيط وسلس.</li>
        <li>يمكن المعلم من إيصال المعلومات بطريقة سهلة.</li>
        <li>يمد المتعلم بمعلومات واضحة ومختصرة.</li>
        <li>تتيح وضوح الإجراءات للمعلم والمتعلم.</li>
    </ul>

    <h5>• تصميم واجهة التفاعل:</h5>
    <p>وتنقسم واجهة تفاعل المستخدم في الواقع المعزز إلى مايلي:</p>
    <ul>
        <li>واجهات المعلومات (AR information Browsers) وهي أكثر الواجهات المستخدمة في الواقع المعزز وتستخدم فيها الهواتف الذكية، وتعتبر أجهزة التشغيل هنا نوافذ لعرض المعلومات الافتراضية في الواقع الحقيقي.</li>
        <li>واجهات المستخدم ثلاثية الأبعاد (3D User interfaces in AR) وهي واجهات تدعم التفاعل المباشر مع الكائنات الإفتراضية.</li>
        <li>واجهات المستخدم الملموسة (Tangible User Interface in AR) وواجهات المستخدم الملموسة هي واجهات تمكن المستخدم من التحكم بالمعلومات الرقمية أو الإفتراضية من خلال التحكم بالعناصر المادية.</li>
        <li>واجهات التفاعل المرتبطة بحركة الجسم (Natural User Interfaces in AR) وهي تعمل بواجهات التفاعل الثلاثية الأبعاد وتتبع حركة الجسم والتعرف باستخدام أنواع مختلفة من اجهزة الاستشعار.</li>
    </ul>

    <h4>• المرحلة الثالثة: مرحلة التطوير:</h4>
    <p>تهدف هذه المرحلة إلى تحديد متطلبات الإنتاج، وتجميع وإنتاج الوسائط المطلوبة، وإنتاج الواقع المعزز بشكل مبدئي، وتتضمن الإجرءات الآتية:</p>
    <div className="text-center">
      <img src={image4} alt="" width="50%"/>
    </div>
    <h5>• تحديد متطلبات الإنتاج:</h5>
    <p>يتم تحديد متطلبات إنتاج الواقع المعزز من البرامج والتطبيقات المساعدة التي تعين المصمم في إنتاج الواقع المعزز، حيث يتم تحديدها وفقًا لمحتوى الواقع المعزز، وأهدافه وللوسائط التي يتم تجميعها أو إنتاجها، وسوف يتم تطوير الواقع المعزز باستخدام Assemblr Studio.</p>
    <h5>• تجميع وإنتاج الوسائط المتعددة المتعلقة بمحتوى الواقع المعزز:</h5>
    <p>وتتمثل في تحديد الوسائط المطلوبة لإنتاج الواقع المعزز سواء كانت: صور ثابتة، أو رسومات ثابتة، أو رسومات متحركة، أو لقطات فيديو، أو ملفات صوتية، وهذه غالبًا ما تكون جاهزة يتم إدراجها من مكتبية تطبيق Assemblr Studio أو البحث عنها وتجميعها من المصادر المتاحة مثل: الشبكات العالمية أو من الموسوعات العلمية، أما بالنسبة للوسائط غير الجاهزة فهي تحتاج للإنتاج بواسطة البرمجيات المتخصصة.</p>
    <p>بحيث يراعى فى الوسائط المتعددة (الجاهزة والمنتجة) المتعلقة بالواقع المعزز ما يلي:</p>
    <h5>أولاً: النصوص المكتوبة</h5>
    <p>ينبغى على المصمم التعليمى أن يراعى المعايير الأساسية الخاصة بالنص في الواقع المعزز وهي:</p>
    <ul>
        <li>اتباع القواعد اللغوية (النحوية والإملائية).</li>
        <li>إظهار أقل قدر ممكن من النص المكتوب بما يفي بالهدف منه على الشاشة.</li>
        <li>الكتابة بحجم مناسب للقراءة.</li>
        <li>أنواع الخطوط المستخدمة يسهل قراءتها.</li>
        <li>استخدام نوعين فقط من أنواع الخطوط.</li>
        <li>البعد عن استخدام الخطوط المزخرفة.</li>
        <li>يختلف حجم الخط المستخدم فى كتابة العناوين عن حجم الخط المستخدم فى كتابة السياق النصى.</li>
        <li>التباين بين لون النص وبين خلفية الصفحة.</li>
        <li>صياغة الفقرات صياغة قصيرة لتتناسب مع شاشة عرض الواقع المعزز.</li>
    </ul>
    <h5>ثانياً: الصور والرسوم الثابتة</h5>
    <p>ينبغى أن يراعى بعض المعايير عند اختيار الصور فى الواقع المعزز:</p>
    <ul>
        <li>وظيفية الصور حسب الحاجة للتعزيز.</li>
        <li>البساطة وقلة التفاصيل.</li>
        <li>الوضوح.</li>
        <li>لا تحتوى على الخدع أو الفلاتر التى تظهر الشئ على غير حقيقته.</li>
        <li>تستخدم صيغ مناسبة للصور ولا تحتاج إلى برامج خاصة لعرضها.</li>
        <li>تكامل عرض الصور مع الوسائط الأخرى لتحقيق أهداف التعلم.</li>
        <li>وثيقة الصلة بموضوع الواقع المعزز.</li>
        <li>تحقق الصور وظائف محددة وتضيف قيمة للمحتوى.</li>
    </ul>
    <h5>ثالثاً: مقاطع الفيديو</h5>
    <p>ينبغى أن يراعى بعض المعايير عند اختيار مقاطع الفيديو فى بيئات الواقع المعزز:</p>
    <ul>
        <li>استخدام لقطات الفيديو بشكل وظيفي حسب الحاجة التعليمية.</li>
        <li>الدقة العلمية.</li>
        <li>وضوح مقاطع الفيديو.</li>
        <li>فترة عرضها مناسبة.</li>
        <li>تكامل الفيديو مع الوسائط الأخرى لتحقيق أهداف التعلم.</li>
        <li>وثيقة الصلة بموضوع الواقع المعزز.</li>
    </ul>
    <h5>رابعًا: الصوت والمؤثرات الصوتية</h5>
    <ul>
        <li>استخدام الصوت لأداء وظائف محددة تحقق الأهداف التعليمية.</li>
        <li>وضوح الصوت.</li>
        <li>مناسبة سرعة الصوت مع أهداف استخدامه.</li>
        <li>استخدام مؤثرات صوتية تيسر الفهم وتضفي واقعية.</li>
        <li>أن يكون الصوت منطوقًا بلغة صحيحة ومخارج الألفاظ واضحة سليمة من الأخطاء اللغوية.</li>
    </ul>
    <h5>خامسًا: الرسوم المتحركة</h5>
    <ul>
        <li>استخدام الرسوم المتحركة بشكل وظيفي لتحقيق الأهداف التعليمية.</li>
        <li>اقتصار الرسوم المتحركة على المواقف التى تتطلب عنصر الحركة.</li>
        <li>اختيار الرسوم المتحركة المناسبة لحركة الشئ الذي سيمثله.</li>
        <li>مراعاة التناسب بين مساحة الرسوم المتحركة مع مساحة شاشة العرض.</li>
    </ul>

    <p>إنتاج الواقع المعزز بشكل مبدئي: باستخدام تطبيق Assemblr Studio وهو عبارة عن منصة مجانية للواقع المعزز تمكن من إنشاء محتوى الواقع المعزز وعرضه ومشاركته بسهولة، وذلك بسحب العناصر المتوفرة في المحرر وإفلاتها، مثل الكائنات ثنائية وثلاثية الأبعاد والصور ومقاطع الفيديو والنصوص. كما يتيح تطوير الواقع المعزز باستخدام QR maker، وCustom maker وبكائنات ثلاثية الأبعاد.</p>

    <h4>• المرحلة الرابعة: مرحلة التنفيذ:</h4>
    <p>وتهدف هذه المرحلة إلى تجريب الواقع المعزز، وتسجيل الملاحظات، واقتراحات تطويره، والتعرف على مدى فعاليته، وقدرته على تحقيق الأهداف والحصول على أفضل النتائج عند التطبيق الفعلي له.</p>

    <h4>• المرحلة الخامسة: مرحلة التقويم:</h4>
    <p>وتهدف هذه المرحلة إلى تقييم الواقع المعزز وقياس كفاءة التعلم من خلاله وذلك بعرضه على مجموعة من المتخصصين، وتحليل النتائج للحكم على صلاحيته، وتتضمن مرحلة التقويم الإجرءات الآتية:</p>
    <div className="text-center">
      <img src={image5} alt="" width="50%"/>
    </div>
    <ol>
        <li>التقويم البنائى Formative Evaluation: وهو تقويم مستمر أثناء كل مرحلة، وبين المراحل المختلفة، والهدف منه تحسين التعلم من خلال الواقع المعزز قبل الوصول للنسخة النهائية التى يتم تنفيذها.</li>
        <li>تقويم المنتج: من خلال تحكيم الواقع المعزز وذلك بعرضه بصورته المبدئية على الخبراء المتخصصين، للتأكد من مناسبته لتحقيق الأهداف، وتقديم المقترحات والتعديلات اللازمة، ويتم ذلك في ضوء معايير تقييم الواقع المعزز، وما يتضمنه من مؤشرات.</li>
    </ol>
    <p>معايير تقييم الواقع المعزز:</p>
    <ul>
        <li>المعايير التربوية في الواقع المعزز.</li>
        <li>أهداف الواقع المعزز موجودة ومصاغة بطريقة صحيحة.</li>
        <li>يتضمن الواقع المعزز الهدف العام منه.</li>
        <li>ينتمي الهدف العام لعنوان الواقع المعزز.</li>
        <li>الهدف العام للواقع المعزز مصاغ صياغة صحيحة.</li>
        <li>يتضمن الواقع المعزز الأهداف التعليمية الخاصة به.</li>
        <li>الأهداف التعليمية للواقع المعزز قابلة للملاحظة والقياس.</li>
        <li>يقيس الهدف التعليمي ناتجًا واحدًا للتعلم.</li>
    </ul>
    <p>• محتوى الواقع المعزز ملائم للأهداف ويتسم بالدقة العلمية والحداثة.</p>
    <ul>
        <li>المحتوي التعليمي للواقع المعزز مناسبًا لتحقيق الأهداف التعليمية.</li>
        <li>المحتوي حديثًا وصحيحًا من الناحية العلمية وخاليًا من الأخطاء اللغوية والنحوية.</li>
        <li>ينظم المحتوي بطريقة تناسب الأهداف التعليمية.</li>
        <li>يتم توسيع المُحتوى عند جمع المعلومات.</li>
        <li>محتوى مقاطع الفيديو التعليمية تعكس الأهداف التعليمية.</li>
        <li>محتوى مقاطع الفيديو التعليمية صحيح من الناحية العلمية.</li>
        <li>الصور المُضمنة في الواقع المعزز تعكس الأهداف التعليمية.</li>
        <li>الصور المُضمنة في الواقع المعزز صحيحة من الناحية العلمية.</li>
    </ul>
    <p>• استراتيجية التعلم: يجب أن يصمم الواقع المعزز وفق استراتيجيات تعليم وتعلم واضحة مناسبة للأهداف والمحتوى وخصائص المتعلمين (كالاكتشاف، حل المشكلات، ....)</p>
    <ul>
        <li>تتناسب الاستراتيجية التعليمية مع طبيعة الواقع المعزز.</li>
        <li>تحقق الاستراتيجية التعليمية الأهداف التعليمية المنشودة.</li>
        <li>تتصف الاستراتيجية التعليمية المستخدمة بالبساطة.</li>
        <li>توظف الاستراتيجية التعليمية المصادر المتاحة بشكل مناسب.</li>
        <li>تتناسب الاستراتيجية التعليمية مع موضوع التعلم.</li>
    </ul>
    <p>• تحكم المتعلم في الواقع المعزز.</p>
    <ul>
        <li>يتيح الواقع المعزز للمُتعلم التحكم في عمليات التواصل والمُناقشة والمُشاركة مع الأخرين.</li>
        <li>يتيح الواقع المعزز للمُتعلم اختيار واجهات التفاعل الخاصة به.</li>
        <li>يتيح الواقع المعزز للمُتعلم اختيار مصادر المعلومات المُختلفة، والخدمات والمُحتوى.</li>
        <li>يتضمن الواقع المعزز إمكانية وصول المُتعلم للمعلومة التي يُريدها.</li>
        <li>تتيح الواقع المعزز للمُتعلم المرونة اللازمة لتخصيص بيئته، وكائنات وأنشطة التعلم وفق قدراته الذاتية.</li>
    </ul>
    <p>• المعايير الفنية في الواقع المعزز.</p>
    <ul>
        <li>النصوص المكتوبة: اتباع القواعد اللغوية (النحوية والإملائية).</li>
        <li>إظهار أقل قدر ممكن من النص المكتوب بما يفي بالهدف منه على الشاشة.</li>
        <li>الكتابة بحجم مناسب للقراءة.</li>
        <li>أنواع الخطوط المستخدمة يسهل قراءتها.</li>
        <li>استخدام نوعين فقط من أنواع الخطوط.</li>
        <li>البعد عن استخدام الخطوط المزخرفة.</li>
        <li>يختلف حجم الخط المستخدم فى كتابة العناوين عن حجم الخط المستخدم فى كتابة السياق النصى.</li>
        <li>التباين بين لون النص وبين خلفية الصفحة.</li>
        <li>صياغة الفقرات صياغة قصيرة لتتناسب مع شاشة عرض الواقع المعزز.</li>
    </ul>
    <p>• الصور والرسوم الثابتة والخطية: وظيفية الصور حسب الحاجة للتعزيز.</p>
    <ul>
        <li>البساطة وقلة التفاصيل.</li>
        <li>الوضوح.</li>
        <li>لا تحتوى على الخدع أو الفلاتر التى تظهر الشئ على غير حقيقته.</li>
        <li>تستخدم صيغ مناسبة للصور ولا تحتاج إلى برامج خاصة لعرضها.</li>
        <li>تكامل عرض الصور مع الوسائط الأخرى لتحقيق أهداف التعلم.</li>
        <li>وثيقة الصلة بموضوع الواقع المعزز.</li>
        <li>تحقق الصور وظائف محددة وتضيف قيمة للمحتوى.</li>
    </ul>
    <p>• مقاطع الفيديو: استخدام لقطات الفيديو بشكل وظيفي حسب الحاجة التعليمية.</p>
    <ul>
        <li>الدقة العلمية.</li>
        <li>وضوح مقاطع الفيديو.</li>
        <li>فترة عرضها مناسبة.</li>
        <li>تكامل الفيديو مع الوسائط الأخرى لتحقيق أهداف التعلم.</li>
        <li>وثيقة الصلة بموضوع الواقع المعزز.</li>
    </ul>
    <p>• الصوت والمؤثرات الصوتية: استخدام الصوت لأداء وظائف محددة تحقق الأهداف التعليمية.</p>
    <ul>
        <li>وضوح الصوت.</li>
        <li>مناسبة سرعة الصوت مع أهداف استخدامه.</li>
        <li>استخدام مؤثرات صوتية تيسر الفهم وتضفي واقعية.</li>
        <li>أن يكون الصوت منطوقًا بلغة صحيحة ومخارج الألفاظ واضحة سليمة من الأخطاء اللغوية.</li>
    </ul>
    <p>• الرسوم المتحركة: استخدام الرسوم المتحركة بشكل وظيفي لتحقيق الأهداف التعليمية.</p>
    <ul>
        <li>اقتصار الرسوم المتحركة على المواقف التى تتطلب عنصر الحركة.</li>
        <li>اختيار الرسوم المتحركة المناسبة لحركة الشئ الذي سيمثله.</li>
        <li>مراعاة التناسب بين مساحة الرسوم المتحركة مع مساحة شاشة العرض.</li>
    </ul>
    <p>• المعايير التكنولوجية في الواقع المعزز.</p>
    <ul>
        <li>واجهة التفاعل: تتصف واجهة تفاعل الواقع المعزز بالبساطة.</li>
        <li>تتصف واجهة تفاعل الواقع المعززبسهولة الاستخدام.</li>
        <li>تدمج واجهة تفاعل الواقع المعزز العناصر الحقيقية مع الافتراضية.</li>
        <li>توفر واجهة تفاعل الواقع المعزز التنقل السلس بين البيئة الحقيقية والافتراضية.</li>
        <li>تحتوى واجهة تفاعل الواقع المعزز على تعليمات التعامل معها.</li>
    </ul>
    <p>• التطبيقات والأجهزة المستخدمة: يجب أن تكون التطبيقات والأجهزة المستخدمة في انتاج وعرض الواقع المعزز متاحة وسهلة الاستخدام.</p>
    <ul>
        <li>اختيار تطبيقًا مفتوح المصدر.</li>
        <li>اختيار تطبيقًا يراعي تفاوت قدرات المتعلمين واختلاف خبراتهم في التعامل مع التكنولوجيا.</li>
        <li>اختيار تطبيقًا مزودًا بإمكانية التعزيز بأنواع الوسائط المختلفة (نصوص، صور ثنائية الأبعاد، وثلاثية الأبعاد، فيديو، صوت، ...).</li>
        <li>اختيار تطبيقًا يسمح بإنشاء وعرض ومشاركة نماذج الواقع المعزز بطريقة سهلة وبسيطة ومثيرة للإهتمام.</li>
        <li>اختيار تطبيقًا يسمح بمشاركة نماذج الواقع المعزز عبر وسائل التواصل المختلفة ليسهل إتاحتها لكافة المستخدمين.</li>
        <li>اختيار تطبيقًا يتوافق مع أنظمة التشغيل في أجهزة المتعلمين.</li>
    </ul>
    <p>• التعقب: يتوفر التعقب من خلال التعرف على الصور.</p>
    <ul>
        <li>يوفر التعقب معلومات أو محتوى متعلق بموضوع التعلم في الوقت الحقيقي.</li>
        <li>تستخدم العناصر المادية للتحكم في العناصر الافتراضية.</li>
        <li>يدعم التفاعل المستمر بين العناصر الحقيقية والافتراضية.</li>
    </ul>
    <p>• الطبقات: يوفر الواقع المعزز طبقة افتراضية واضحة ومختصرة.</p>
    <ul>
        <li>تركز كل طبقة افتراضية على فكرة واحدة.</li>
        <li>تعرض الطبقة الافتراضية في فترة زمنية مناسبة.</li>
    </ul>
    <p>• العلامات: يجب أن تكون العلامات واضحة وفق المعايير الفنية والتربوية.</p>
    <ul>
        <li>ترتب مواضع العلامات في كل صفحة حسب ارتباطها بالمحتوى بحيث لا تتداخل وتشتت المتعلم.</li>
        <li>مراعاة التناسب بين محتوى الصفحة وكثافة العلامات بحيث يراعى كم المعلومات وطبيعة الأهداف وخصائص المتعلم.</li>
        <li>توزع العلامات في أماكن حسب موضوعها.</li>
        <li>يتيح تصميم العلامات تفاعل المتعلم معها.</li>
        <li>ترتبط العلامات المستخدمة بالمحتوى التعليمي.</li>
    </ul>
    <p>• سهولة استخدام الواقع المعزز، والإبحار والتجول.</p>
    <ul>
        <li>يتم الوصول للواقع المعززبشكل سهل وواضح.</li>
        <li>يتميز الواقع المعززبسرعة تحميل عناصره.</li>
        <li>يوفر الواقع المعززللمُتعلم سهولة الإبحار والتنقل والاختيار.</li>
        <li>تعرض صفحات الواقع المعززبشكل صحيح وكامل على الشاشة.</li>
        <li>يمكن عرض الواقع المعزز من خلال المتصفحات المختلفة.</li>
    </ul>
    <p>إجراء التعديلات: يتم إجراء التعديلات اللازمة على نسخة الواقع المعزز المبدئية في ضوء النتائج التي تم الحصول عليها من قبل الخبراء والمتخصصين.</p>
    <p>إعداد الصورة النهائية لبيئة الواقع المعزز: بعد إجراء التعديلات على النسخة المبدئية للواقع المعزز في ضوء آراء الخبراء المتخصصين، ونشر ومشاركة البيئة.</p>

  </div>
)

export default unit_three
