import image1 from "../images/image_2_1.png";
import image2 from "../images/image_2_2.png";
import image3 from "../images/image_2_3.png";
import image4 from "../images/image_2_4.png";
import image5 from "../images/image_2_5.png";
import image6 from "../images/image_2_6.png";
import image7 from "../images/image_2_7.png";
import image8 from "../images/image_2_8.png";
import image9 from "../images/image_2_9.png";
import image10 from "../images/image_2_10.png";
import image11 from "../images/image_2_11.png";
import image12 from "../images/image_2_12.png";
import image13 from "../images/image_2_13.png";
import image14 from "../images/image_2_14.png";
import image15 from "../images/image_2_15.png";
import image16 from "../images/image_2_16.png";
import image17 from "../images/image_2_17.png";
import image18 from "../images/image_2_18.png";
import image19 from "../images/image_2_19.png";
import image20 from "../images/image_2_20.png";
import image21 from "../images/image_2_21.png";
import image22 from "../images/image_2_22.png";
import image23 from "../images/image_2_23.png";
import image24 from "../images/image_2_24.png";
import image25 from "../images/image_2_25.png";
import image26 from "../images/image_2_26.png";
import image27 from "../images/image_2_27.png";
import image28 from "../images/image_2_28.png";
import image29 from "../images/image_2_29.png";
import image30 from "../images/image_2_30.png";
import image31 from "../images/image_2_31.png";
import image33 from "../images/image_2_33.png";
import image34 from "../images/image_2_34.png";


const unit_two = (
  <div>
    <u className="text-red text-bold text-large text-center">
      الموديول الثاني: تطبيقات الواقع المعزز و معايير تطويره
    </u>
    <br />
    <div className="text-red text-bold">تطبيقات الواقع المعزز</div>
    <br />
    <div className="text-bold">Merge Cube</div>
    <br></br>
    <div className="text-center">
      <img src={image1} alt="" width="30%"/>
    </div>
    <br />
    <div>
      هذا التطبيق   Merge Cube | AR/VR Learning & Creation     يسمح للطالب بتحويل Merge Cube  إلى كائنات ثلاثية الأبعاد واقعية. يمكن للطالب استكشاف الأحياء والفضاء والهندسة والتاريخ وأكثر من ذلك، وذلك من خلال تفاعلهم مع   Merge Cube باستخدام الكاميرا على هواتفهم الذكية أو أجهزة الحاسوب اللوحية  ، ويستخدم في : العلوم، الكيمياء ، الفيزياء ،  الأحياء،  الجغرافيا
    <br></br>
      مميزاته : 
    <ul>
      <li>متوافق مع أجهزة iOS و Android و Windows</li>
      <li> يتيح  كائنات رقمية ثلاثية الأبعاد للتعلم في العلوم .</li>
      <li> يقدم أكثر من 100 محاكاة علمية تفاعلية للتعلم الفعال</li>
      <li> يسمح بتحميل وعرض ومشاركة التصميمات ثلاثية الأبعاد التي أنشأها المستخدم على Merge Cube</li>
      <li> يدمج  Merge Cube العوالم المادية والرقمية بسلاسة في الجمع بين الواقع الافتراضي والواقع المعزز </li>
      <li> يتوافق Merge Cube أيضًا مع نظارات VR / AR ، مما يحقق مستوى من الانغماس في التعلم </li>
      <li> هو أداة تعليمية رائعة تعزز تعلم العلوم والتكنولوجيا والهندسة والرياضيات </li>
      <li> يعتبر Merge Cube مثاليًا للإعدادات التعليمية ، ويشجع التعلم التفاعلي ويعزز الفهم الأعمق للمفاهيم المعقدة. .</li>
    </ul>
    <div className="text-center">
      <img src={image2} alt="" width="30%"/>
      <img src={image3} alt="" width="30%"/>
    </div>
  </div>
  <br/><br/>
  <div className="text-bold">Quiver</div>
    <div className="text-center">
      <img src={image4} alt="" width="30%"/>
    </div>
    <br/>
    <div>
    يتيح هذا التطبيق للطالب تلوين الصور ثنائية الأبعاد، ثم يقوم بتحويلها إلى صور ثلاثية الأبعاد عند استخدام الكاميرا. يمكن للطالب استكشاف وتفاعل مع الصور الملونة بواسطة محتوى الواقع المعزز، مما يعزز التفاعل والتعلم التجريبي، ويستخدم في : الرياضيات، الجغرافيا، التاريخ، الفيزياء
    <br></br>
    <div className="text-center">
      <img src={image5} alt="" width="30%"/>
    </div>
      مميزاته : 
    <ul>
      <li>يوفر تطبيق Quiver منصة تعليمية تساعد الطلاب على تصور وفهم مختلف الموضوعات التعليمية بشكل أفضل.</li>
      <li>يشتمل الموقع على مجموعة كبيرة من دروس الواقع المعزز ، التي تم إنشاؤها بواسطة المعلمين والمعلمين ،</li>
      <li>مصمم خصيصًا لتلبية احتياجات جميع الطلاب من خلال دمج مجموعة متنوعة من الأنشطة.</li>
      <li>يجعل تطبيق Quiver التعلم ممتعًا من خلال الجمع بين التلوين المادي وتكنولوجيا الواقع المعزز الرائعة لإنشاء تجربة جذابة وتعليمية وسحرية.</li>
      <li>يجعل تطبيق Quiver مجموعة كبيرة من الموضوعات التعليمية ممتعة للتعرف عليها من خلال السماح للمستخدمين بالإبداع والخيال.</li>
    </ul>
  </div>

  <br/><br/>
  <div className="text-bold">AR Anatomy</div>
    <div className="text-center">
      <img src={image6} alt="" height="200px"/>
      <img src={image7} alt="" height="200px"/>
    </div>
    <br/>
    <div>
    يسمح هذا التطبيق للطالب باستكشاف الجسم البشري ثلاثي الأبعاد باستخدام الواقع المعزز و رؤية جسم الإنسان بأدق التفاصيل ، من خلال تفاعله، مما يساعده على فهم وتعلم تشريح الجسم البشري بشكل أكثر واقعية، فهو يحتوي على كافة أجهزة جسم الإنسان ، ويستخدم في  العلوم ، و الأحياء 
    <br></br>
    <div className="text-center">
      <img src={image8} alt="" width="30%" height="200px"/>
      <img src={image9} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">blippAR</div>
    <div className="text-center">
      <img src={image10} alt="" width="30%"/>
    </div>
    <br/>
    <div>
      هو تطبيق يُمكن من مسح الجزء الموجود في الصفحات الداخلية للتواصل مع المحتوى التفاعلي الذي يفتح  العرض التقديمي ثنائي الأبعاد ؛ مما يساعد  المستخدم على التفكير بعمق أكبر واستكشاف الموضوع بطريقة جديدة.
    <br></br>
      مميزاته : 
    <ul>
      <li>ينشئ الواقع المعزز لاستخدامه على أي جهاز.</li>
      <li>يتيح إنشاء الواقع المعزز بسهولة و إمكانية الوصول المجاني إلى آلاف النماذج ثلاثية الأبعاد</li>
      <li>يمكن نشر و مشاركة الواقع المعزز عبر الويب ووسائل التواصل الاجتماعي</li>
      <li>يتيح الاستفادة من خصائص الواقع المعزز:  مثل تتبع السطح والعلامة </li>
      <li>يتيح التغذية الراجعة الفورية</li>
    </ul>
    <div className="text-center">
      <img src={image11} alt="" width="30%"/>
      <img src={image12} alt="" width="30%"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">Alive Studios</div>
    <div className="text-center">
      <img src={image13} alt="" width="30%"/>
    </div>
    <br/>
    <div>
      تطبيق يساعد على تطوير تقنية الواقع المعزز لخلق تجارب التعلم التي تثير تفكير المستخدم وتساعد على إنشاء وتطوير الواقع المعزز التي تحقق مشاركة حقيقية وملموسة للمستخدم ويستخدم في :  العلوم ، الرياضيات ،والجيولوجيا
    <br></br>
    <div className="text-center">
      <img src={image14} alt="" width="30%" height="200px"/>
      <img src={image15} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">Aurasma</div>
    <div className="text-center">
      <img src={image16} alt="" width="30%"/>
    </div>
    <br/>
    <div>
      من أشهر تطبيقات الهواتف النقالة لإنتاج تكنولوجيا الواقع المعزز بشكل فعال وبسهولة، فهو ييسر تصميم بيئة واقع معزز تعليمية جذابة وثرية وممتعة وفي متناول الجميع سواء كانوا معلمين أو متعلمين ومن خلال منصات الكترونية متعددة مثل الحواسيب الشخصة أو الهواتف الذكية أو الأجهزة اللوحية، وهو التطبيق الرائد في إنتاج الواقع المعزز، والذي سيغيرطريقة التفاعل مع المحتوى الرقمي حيث يسمح التطبيق بإنشاء ومشاركة الواقع المعزز بطريقة سهلة وبسيطة و يمكن المعلم من الاتصال بالمحتوى الرقمي عن طريق تتبع الصور التي في الكتب 
    <br></br>
    <div className="text-center">
      <img src={image17} alt="" width="30%" height="200px"/>
      <img src={image18} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">تطبيق رمز الاستجابة السريع QR Code</div>
    <br/>
    <div>
      قائم على العلامة يسمح بعمل مسح ضوئي للمواد المطبوعة وتعزيزها بمحتوى افتراضي يتفاعل معه المتعلم 
    <br></br>
    <div className="text-center">
      <img src={image19} alt="" width="30%" height="200px"/>
      <img src={image20} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">Layar</div>
    <div className="text-center">
      <img src={image21} alt="" width="30%"/>
    </div>
    <br/>
    <div>
      يتيح إجراء مسح ضوئي للمواد المطبوعة ، وتعزيزها بإضافة  الواقع المعزز و المعطيات الإفتراضية المطلوبة ؛ مما يسمح بالتفاعل مع الواقع بطريقة جديدة ، ويستخدم نظام العلامات.
    <br></br>
    <div className="text-center">
      <img src={image22} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">تطبيق 4 Augmented</div>
    <br/>
  <div>
      يتم من خلاله الوصول للعناصر الرقمية ثلاثية الأبعاد والتعامل معها بطريقة تفاعلية
  </div>

  <br/><br/>
  <div className="text-bold"> تطبيق ELEMENTS 4D</div>
    <br/>
    <div>
      يعتبر هذا التطبيق قصة ولعبة تعليمية حيث يقدم طريقة جديدة ومسلية لتجربة الواقع المعزز والتعلم حول الكيمياء الحقيقية، يمكن من خلاله إجراء تفاعلات كيميائية إفتراضية عبر الأجهزة الذكية، ويقوم بتحويل أي شيء إلى شيء متحرك رباعي الأبعاد باستخدام الأوراق أو القطع الخشبية المكتوبة برموز 36 عنصر من الجدول الدوري.
    <br></br>
    <div className="text-center">
      <img src={image23} alt="" width="30%" height="200px"/>
      <img src={image24} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold">تطبيقHOLO</div>
    <br/>
    <div>
      هو أحد تطبيقات الواقع المعزز الذي يتيح إضافة مجموعة من الصور ثلاثيـة الأبعاد افتراضية في فيديو، مما يزيد من عنصر التشويق فـي العمليـة التعليمية، ويتيح إمكانية مشاركتها مع الآخرين . 
    <br></br>
    <div className="text-center">
      <img src={image25} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold"> تطبيق Field Trip</div>
    <br/>
    <div>
      يشتمل هذا التطبيق على قاعدة بيانات شاملة عن مختلف الأشياء الموجودة في العالم، ما يوفر دعما معرفيا للمتعلم يمكنه من الاعتماد عليه في التعرف على الأشياء المحيطة به والحصول على معلومات كافية عنها، عبر تقريب كاميرا الهاتف الذكي من الشيء لتظهر بطاقة على الشاشة تعرض تفاصيل مهمة حول هذا الشئ ، كما يوفر التطبيق قراءة المعلومات للمتعلم من خلال التعليق الصوتي.
    <br></br>
    <div className="text-center">
      <img src={image26} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <br/><br/>
  <div className="text-bold"> تطبيق Word Lens</div>
    <br/>
    <div>
      يعتمد تطبيق Word Lens على تقنية الواقع المعزز ويستخدم  كاميرا الأجهزة الذكية لتصوير الكلمات وترجمتها بشكل فوري إلى سبع لغات مختلفة، ويساعد المتعلم على الترجمة من وإلى لغات مختلفة بشكل أسهل من خلال توجيه الكاميرا إلى الكتاب المدرسي وبشكل فوري.
    <br></br>
    <div className="text-center">
      <img src={image27} alt="" width="30%" height="200px"/>
    </div>
  </div>

  <div className="text-bold"> تطبيق  Assemblr Studio</div>
    <div className="text-center">
      <img src={image28} alt="" width="30%" height="200px"/>
    </div>
    <br/>
    <div>
    هو تطبيق سهل الاستخدام و مفتوح المصدر و يتيح تطوير الواقع المعزز باستخدام   
    ، وكائنات ثلاثية الأبعاد  Custom maker  ، QR maker  
    و هو ما سيتم استخدامه لتطوير الواقع المعزز في العلوم
    <br></br>
    <div className="text-center">
      <img src={image29} alt="" width="70%" height="200px"/>
    </div>
  </div>

  <div className="text-red text-bold">معايير تطوير الواقع المعزز</div>
  <br/>
  <div>
    تنقسم معايير تطوير الواقع المعزز إلى
  </div>
  <br/>
  <div className="text-center">
    <img src={image30} alt="" width="70%"/>
  </div>

  <div className="text-bold"> معايير تربوية</div>
    <div className="text-center">
      <img src={image31} alt="" width="30%" height="200px"/>
    </div>
    <br/>
    <div>
      الأهداف التعليمية : يجب أن يضمن الواقع المعزز الأهداف التعليمية وفق المعايير التربوية وهي
      <ul>
        <li>تضمن الواقع المعززالهدف العام منه.</li>
        <li>ينتمي الهدف العام لعنوان الواقع المعزز.</li>
        <li>الهدف العام للواقع المعززمصاغ صياغة صحيحة .</li>
        <li>يتضمن الواقع المعززالأهداف التعليمية الخاصة به .</li>
        <li>الأهداف التعليمية للواقع المعززقابلة للملاحظة والقياس </li>
        <li>الأهداف التعليمية للواقع المعززمصاغة بدلالة سلوك المتعلم المراد تحقيقه</li>
        <li>يقيس الهدف التعليمي ناتجًا واحدًا للتعلم .</li>
      </ul>
  </div>

  <div>
    المحتوى التعليمي : يجب أن يتوفر في المحتوى الشروط و المعايير التربوية اللازمة لتنظيمه و صياغته
      <ul>
        <li>المحتوي التعليمي للواقع المعززمناسبا لتحقيق الاهداف التعليمية .</li>
        <li>المحتوي حديثا وصحيحا من الناحية العلمية وخاليا من الاخطاء اللغوية والنحوية.</li>
        <li>ينظم المحتوي بطريقة تناسب الاهداف التعليمية .</li>
        <li>يتم توسيع المُحتوى عند جمع المعلومات.</li>
      </ul>
  </div>

  <div>
    استراتيجية التعلم : يجب أن يصمم الواقع المعزز وفق استراتيجيات تعليم وتعلم واضحة مناسبة للأهداف و المحتوى و خصائص المتعلمين ( كالاكتشاف ، حل المشكلات ، .... ) 
      <ul>
        <li>تتناسب الاستراتيجية التعليمية مع طبيعة الواقع المعزز </li>
        <li>تحقق الاستراتيجية التعليمية الأهداف التعليمية المنشودة </li>
        <li>تتصف الاستراتيجية التعليمية المستخدمة بالبساطة </li>
        <li>توظف الاستراتيجية التعليمية المصادر المتاحة بشكل مناسب </li>
        <li>تتناسب الاستراتيجية التعليمية مع موضوع التعلم </li>
      </ul>
  </div>

  <div>
    حكم المتعلم فى الواقع المعزز : يجب أن يتيح الواقع المعزز إمكانية لتحكم المتعلم تتمثل في : 
      <ul>
        <li>يتيح الواقع المعززللمُتعلم التحكم في عمليات التواصل والمُناقشة والمُشاركة مع الأخرين </li>
        <li>يتيح الواقع المعززللمُتعلم اختيار واجهات التفاعل الخاصة به .</li>
        <li>يتيح الواقع المعززللمُتعلم اختيار مصادر المعلومات المُختلفة، والخدمات والمُحتوى.</li>
        <li>يتضمن الواقع المعززإمكانية وصول المُتعلم للمعلومة التي يُريدها .</li>
        <li>تتيح الواقع المعززللمُتعلم المرونة اللازمة لتخصيص بيئته، و كائنات وأنشطة التعلم وفق قدراته الذاتية.</li>
      </ul>
  </div>

  <div className="text-bold"> معايير فنية</div>
    <div className="text-center">
      <img src={image33} alt="" width="30%" height="200px"/>
    </div>
    <br/>
    <div>
      تتعلق بوسائط التعزيز الرقمية : يجب أن يراعي اختيار عناصرالتعزيز الرقمية وفق المعايير الفنية  وهي
    </div>

  <div>
    النصوص
      <ul>
        <li>اتباع القواعد اللغوية ( النحوية والإملائية ) .</li>
        <li>إظهار أقل قدر ممكن من النص المكتوب بما يفي بالهدف منه  على الشاشة </li>
        <li>الكتابة بحجم مناسب للقراءة.</li>
        <li>أنواع الخطوط المستخدمة يسهل قراءتها.</li>
        <li>استخدام نوعين فقط من أنواع الخطوط.</li>
        <li>البعد عن استخدام الخطوط المزخرفة.</li>
        <li>يختلف حجم الخط المستخدم فى كتابة العناوين عن حجم الخط المستخدم فى كتابة السياق النصى.</li>
        <li>التباين بين لون النص وبين خلفية الصفحة</li>
        <li>صياغة الفقرات صياغة قصيرة لتتناسب مع شاشة عرض الواقع المعزز </li>
      </ul>
  </div>

  <div>
    الصور والرسوم الثابتة
      <ul>
        <li>وظيفية الصور حسب الحاجة للتعزيز </li>
        <li>البساطة وقلة التفاصيل.</li>
        <li>الوضوح.</li>
        <li>لا تحتوى على الخدع أو الفلاتر التى تظهر الشئ على غير حقيقته.</li>
        <li>تستخدم صيغ مناسبة للصور ولا تحتاج إلى برامج خاصة لعرضها.</li>
        <li>تكامل عرض الصور مع الوسائط الأخرى لتحقيق أهداف التعلم.</li>
        <li>وثيقة الصلة بموضوع  الواقع المعزز.</li>
        <li>تحقق الصور وظائف محددة وتضيف قيمة للمحتوى </li>
      </ul>
  </div>

  <div>
    مقاطع  الفيديو
      <ul>
        <li>استخدام مقاطع الفيديو بشكل وظيفي حسب الحاجة التعليمية </li>
        <li>الدقة العلمية.</li>
        <li>وضوح مقاطع الفيديو .</li>
        <li>فترة عرضها مناسبة .</li>
        <li>تكامل الفيديو  مع الوسائط الأخرى لتحقيق أهداف التعلم.</li>
        <li>وثيقة الصلة بموضوع الواقع المعزز.</li>
      </ul>
  </div>

  <div>
    الصوت  و المؤثرات الصوتية
      <ul>
        <li>استخدام الصوت لأداء وظائف محددة تحقق الأهداف التعليمية </li>
        <li>وضوح الصوت </li>
        <li>مناسبة سرعة الصوت مع  أهداف استخدامه </li>
        <li>استخدام مؤثرات صوتية تيسر الفهم و تضفي واقعية </li>
        <li>أن يكون الصوت منطوقًا بلغة صحيحة ومخارج الألفاظ واضحة سليمة من الأخطاء اللغوية .</li>
      </ul>
  </div>

  <div>
    الرسوم المتحركة
      <ul>
        <li>استخدام الرسوم المتحركة بشكل وظيفي لتحقيق الأهداف التعليمية </li>
        <li>اقتصار الرسوم المتحركة على المواقف التى تتطلب عنصر الحركة </li>
        <li>اختيار الرسوم المتحركة المناسبة لحركة الشئ الذي سيمثله </li>
        <li>مراعاة التناسب بين مساحة الرسوم المتحركة مع مساحة شاشة العرض .</li>
      </ul>
  </div>

  <div className="text-bold"> معايير تكنولوجية</div>
    <div className="text-center">
      <img src={image34} alt="" width="30%" height="200px"/>
    </div>
    <br/>
    <div>
      و تشمل العناصر التالية
    </div>

  <div>
    واجهة التفاعل
      <ul>
        <li>تتصف واجهة تفاعل الواقع المعزز بالبساطة </li>
        <li>تتصف واجهة تفاعل الواقع المعززبسهولة الاستخدام .</li>
        <li>تدمج واجهة تفاعل الواقع المعزز العناصر الحقيقية مع  الافتراضية </li>
        <li>توفر واجهة تفاعل الواقع المعزز التنقل السلس بين البيئة الحقيقية و الافتراضية</li>
        <li>تحتوى واجهة تفاعل الواقع المعزز على تعليمات التعامل معها </li>
      </ul>
  </div>

  <div>
    التطبيقات و الأجهزة المستخدمة :يجب أن تكون التطبيقات و الأجهزة المستخدمة في انتاج وعرض الواقع المعزز متاحة وسهلة الاستخدام 
      <ul>
        <li>اختيار تطبيقًا مفتوح المصدر </li>
        <li>اختيار تطبيقًا يراعي تفاوت قدرات المتعلمين و اختلاف خبراتهم في التعامل مع التكنولوجيا </li>
        <li>اختيار تطبيقًا مزودَا بإمكانية التعزيز بأنواع الوسائط المختلفة ( نصوص ، صور ثنائية الأبعاد ، وثلاثية الأبعاد ، فيديو ، صوت ، ... ) </li>
        <li>اختيار تطبيقًا يسمح بإنشاء و عرض ومشاركة نماذج الواقع المعزز بطريقة سهلة و بسيطة ومثيرة للإهتمام </li>
        <li>اختيار تطبيقًا يسمح بمشاركة نماذج الواقع المعزز عبر وسائل التواصل المختلفة ليسهل إتاحتها لكافة المستخدمين </li>
        <li>اختيار تطبيقًا يتوافق مع أنظمة التشغيل في أجهزة  المتعلمين </li>
      </ul>
  </div>

  <div>
    التعقب
      <ul>
        <li>يتوفر التعقب من خلال التعرف على الصور </li>
        <li>يوفر التعقب معلومات او محتوى متعلق بموضوع التعلم في الوقت الحقيقي   </li>
        <li>تستخدم العناصر المادية للتحكم في العناصر الافتراضية  </li>
        <li>يدعم التفاعل المستمر بين العناصر الحقيقية و الافتراضية  </li>
      </ul>
  </div>

  <div>
    الطبقات
      <ul>
        <li>يوفر الواقع المعزز طبقة افتراضية واضحة ومختصرة </li>
        <li>تركز كل طبقة افتراضية على فكرة واحدة </li>
        <li>تعرض الطبقة الافتراضية في فترة زمنية مناسبة </li>
      </ul>
  </div>

  <div>
    العلامات : يجب أن تراعي علامات التعزيز المعايير الفنية و التربوية وهي: 
      <ul>
        <li>وضوح علامة التعزيز </li>
        <li>ارتباط علامات التعزيز المستخدمة بالمحتوى التعليمي </li>
        <li>توزع علامات التعزيز في أماكن  حسب موضوعها </li>
        <li>يتيح تصميم علامات التعزيز تفاعل المتعلم معها </li>
        <li>ترتب مواضع العلامات في كل صفحة حسب ارتباطها بالمحتوى بحيث لا تتداخل وتشتت المتعلم </li>
        <li>مراعاة التناسب بين محتوى الصفحة وكثافة علامات التعزيز بحيث يراعى كم المعلومات و طبيعة الأهداف و خصائص المتعلم </li>
      </ul>
  </div>

  <div>
    سهولة استخدام الواقع المعزز، و الإبحار و التجول
      <ul>
        <li>يتم الوصول للواقع المعززبشكل سهل وواضح.</li>
        <li>يتميز الواقع المعززبسرعة تحميل عناصره.</li>
        <li>يوفر الواقع المعززللمُتعلم سهولة الإبحار والتنقل والاختيار.</li>
        <li>تعرض صفحات الواقع المعززبشكل صحيح وكامل على الشاشة.</li>
        <li>يمكن عرض الواقع المعززمن خلال المتصفحات المختلفة.</li>
      </ul>
  </div>

</div>
)

export default unit_two
