function Instructions() {
  return (
  <>
    <div className="text-center">
      <br/>
      <br/>
      <u className='text-red text-bold text-large'>
      تعليمات استخدام بيئة التعلم الإلكترونية بنمطي المساعد الإفتراضي الذكي  ( الموجه بالمهمة / الموجه بالمستخدم)
      </u> 
    </div>
    <div className="text-center">
      <div>
      عزيزى الطالب/ عزيزتى الطالبة هذه البيئة صُممت من أجلك بهدف تنمية مهارات تطوير الواقع المعزز وخفض التجول العقلي و الإجهاد الرقمي لديك ، وقبل البدء بالدراسة يرجى اتباع التعليمات التالية : 
      </div>
    </div>
    <div className="text-center">
      <ol>
        <li>عليك أن تجيب عن الاختبار القبلي الكلي لبيئة التعلم الإلكترونية بنمطي المساعد الإفتراضي الذكي  ( الموجه بالمهمة / الموجه بالمستخدم قبل دراسة الموديولات لتحديد مستوى تعلمك ، ثم بعد ذلك تجيب عن مقياس التجول العقلي و مقياس الإجهاد الرقمي، ثم تنتقل لدراسة الموديولات بالترتيب.</li>
        <li>عدد الموديولات المتضمنة فى بيئة التعلم أربعة موديولات</li>
        <li>عليك أن تجيب عن الاختبار القبلي لكل موديول من موديولات البيئة </li>
        <li>عليك أن تقرأ الأهداف التعليمية لكل موديول قراءة جيدة، ثم تبدأ فى دراسة محتوى الموديول </li>
        <li>عليك أداء المهام الخاصة بكل موديول باستخدام المساعد الإفتراضي الذكي  الموجود ببيئة التعلم الإلكترونية.</li>
        <li>فيما يتعلق بنمط المساعد الإفتراضي الذكي  ( الموجه بالمهمة) سيتم الإجابة فيما يتعلق بمحتوى المهمة و متطلبات إنجازها . </li>
        <li>فيما يتعلق بنمط المساعد الإفتراضي الذكي (الموجه بالمستخدم) سيتم الاستجابة في ضوء احتياجاتك لأداء المهام و إنجازها . </li>
        <li>يجب أن تجيب عن الاختبار البعدي لكل موديول .</li>
        <li>  بعد إنتهائك عزيزى الطالب من دراسة جميع الموديولات ، قم بالإجابة عن الاختبار البعدي الكلي لبيئة التعلم الإلكترونية بنمطي المساعد الإفتراضي الذكي  ( الموجه بالمهمة / الموجه بالمستخدم)  و مقياس التجول العقلي و مقياس الإجهاد الرقمي </li>
        <li> عليك الإلتزام بالخطة الزمنية المُحددة لدراسة المحتوى المتعلق بتطوير الواقع المعزز والمعلنة لك على بيئة تعلمك . </li>
      </ol>
    </div>
  </>
  );
}

export default Instructions;
