function Objectives() {
  return (
    <>
      <div className="text-center">
        <br/>
        <br/>
        <u className='text-red text-bold text-large'>
        أهداف بيئة التعلم الإلكترونية بنمطي المساعد الإفتراضي الذكي  ( الموجه بالمهمة / الموجه بالمستخدم)
        </u> 
      </div>
      <div className="text-center">
        <br/>
        <br/>
        <b>الأهداف العامة :</b>
      </div>
      <div className="text-center">
        <div>
        تم تحديد أربعة أهداف عامة لبيئة التعلم القائمة على إنترنت الأشياء وهي أن يُلم الطالب بما يلي: 
        </div>
      </div>
      <div className="text-center">
        <ol>
          <li>خلفية نظرية عن ماهية الواقع المعزز</li>
          <li>تطبيقات الواقع المعزز و معايير تطويره</li>
          <li>مراحل تطويرالواقع المعزز</li>
          <li>تطوير الواقع المعزز باستخدام Assemblr Studio</li>
        </ol>
      </div>

      <div className="text-center">
        <br/>
        <br/>
        <b>الأهداف التعليمية :</b>
      </div>
      <div className="text-center">
        <div>
        ينبغي بنهاية دراسة بيئة التعلم الإلكترونية بنمطي المساعد الإفتراضي الذكي           ( الموجه بالمهمة / الموجه بالمستخدم) أن يكون الطالب قادرًا على أن :
        </div>
      </div>
      <div className="text-center">
        <ol>
          <li>يتعرف على مفهوم الواقع المعزز</li>
          <li>يتعرف على خصائص الواقع المعزز </li>
          <li>يميز بين خصائص الواقع المعزز</li>
          <li>يتعرف على أنواع الواقع المعزز </li>
          <li>يميز بين أنواع الواقع المعزز </li>
          <li>يتعرف على آلية عمل الواقع المعزز</li>
          <li>يميز بين مراحل آلية عمل الواقع المعزز</li>
          <li>يحدد أهمية توظيف الواقع المعزز في  العملية التعليمية.</li>
          <li>يتعرف على مكونات الواقع المعوو </li>
          <li>يميز بين مكونات الواقع المعزز</li>
          <li>يتعرف على تطبيقات الواقع المعزز</li>
          <li>يميز بين تطبيقات الواقع المعزز</li>
          <li>يتعرف على مميزات كل تطبيق من تطبيقات الواقع المعزز</li>
          <li>يختار أحد تطبيقات الواقع المعزز الملائم لتخصصه </li>
          <li>يتعرف على  معايير تطوير الواقع المعزز</li>
          <li>يميز بين معايير تطوير الواقع المعزز</li>
          <li>يتعرف على شروط كل معيار من معايير تطوير الواقع المعزز</li>
          <li>يطبق معايير تطوير الواقع المعزز في مجال تخصصه</li>
          <li>يتعرف على مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
          <li>يميز بين مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
          <li>يتعرف على  إجراءات كل مرحلة من مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
          <li>يميز بين إجراءات كل مرحلة من مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
          <li>يحدد أهمية مرحلة التحليل فى النموذج العام ADDIE</li>
          <li>يتعرف على إجراءات مرحلة التحليل فى النموذج العام ADDIE</li>
          <li>يحدد إجراءات مرحلة التصميم فى النموذج العام ADDIE</li>
          <li>يتعرف على الهدف العام المصاغ بشكل صحيح   </li>
          <li>يتعرف على شروط الصياغة الجيدة للأهداف التعليمية</li>
          <li>يتعرف على الهدف التعليمى المصاغ بشكل صحيح   </li>
          <li>يتعرف على إجراءات مرحلة التطوير فى النموذج العام ADDIE</li>
          <li>يحدد إجراءات مرحلة التنفيذ فى النموذج العام ADDIE</li>
          <li>يتعرف على إجراءات مرحلة التقويم فى النموذج العام ADDIE</li>
          <li>يطبق معايير تقييم  الواقع المعزز في مجال تخصصك   </li>
          <li>يحدد الحاجات التعليمية: أى تحديد المشكلة التي تتطلب تطوير الواقع المعزز. </li>
          <li>يحدد الأهداف العامة  للواقع المعزز. </li>
          <li>يختار عنوان للواقع المعزز في ضوء الأهداف العامة </li>
          <li>يحدد خصائص المتعلمين: وهي الفئة المستهدفة من استخدام الواقع المعزز. </li>
          <li>يصيغ الأهداف التعليمية للواقع المعزز. </li>
          <li>يحدد محتوى الواقع المعزز.   </li>
          <li>يقترح عدد من الوسائط المتعددة التي تتناسب مع العناصر السابقة للواقع المعزز  </li>
          <li>تتعرف على مميزات تطبيق Assemblr Studio</li>
          <li>تُعدد خصائص  تطبيق Assemblr Studio</li>
          <li>تميز بين خصائص  تطبيق Assemblr Studio</li>
          <li>تحمل  تطبيق Assemblr Studio  من متجر التطبيقات</li>
          <li>تسجل الدخول على موقع  Assemblr Studio   </li>
          <li>تنشئ  مشروع جديد</li>
          <li>تضيف شكل ثلاثى الابعاد</li>
          <li>تحرك الشكل ثلاثى الابعاد فى الاتجاهات الثلاثة</li>
          <li>تكبر حجم الشكل ثلاثى الابعاد</li>
          <li>تضيف صورة في المشروع </li>
          <li>تضيف نصوص في المشروع </li>
          <li>تغير خلفية واجهه المشروع </li>
          <li>تضيف الموسيقى او المؤثرات الصوتية في المشروع</li>
          <li>تحفظ المشروع</li>
          <li>تعرض المشروع ثلاثى الابعاد فى الواقع الفعلى</li>
          <li>تضيف مشهد اخر للمشروع</li>
          <li>تنشر المشروع باستخدام  Qr Code</li>
          <li>تشارك المشروع مع الزملاء  </li>
          <li>تكتب عنوان للمشروع</li>
          <li>تعمل علامة مخصصة (custom AR maker لاظهار الواقع المعزز عليها ) .</li>
        </ol>
      </div>
    </>
  );
}

export default Objectives;
