const unit_three = (
  <>
  <u className='text-red text-bold text-large'>
    أهداف الموديول الثالث : مراحل تطوير الواقع المعزز
  </u>
  <div>
    <br />
    عزيزى الطالب / عزيزتى الطالبة بعد الانتهاء من دراستك لهذا الموضوع ينبغى أن تكون قادرًا على أن:
  </div>
  <ol>
    <li>تتعرف على مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
    <li>تميز بين مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
    <li>تتعرف على  إجراءات كل مرحلة من مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
    <li>تميز بين إجراءات كل مرحلة من مراحل تطوير الواقع المعزز وفق النموذج العام للتصميم التعليمى  ADDIE</li>
    <li>تحدد أهمية مرحلة التحليل فى النموذج العام ADDIE</li>
    <li>تتعرف على إجراءات مرحلة التحليل فى النموذج العام ADDIE</li>
    <li>تحدد إجراءات مرحلة التصميم فى النموذج العام ADDIE</li>
    <li>تتعرف على الهدف العام المصاغ بشكل صحيح</li>
    <li>تتعرف على شروط الصياغة الجيدة للأهداف التعليمية</li>
    <li>تتعرف على الهدف التعليمى المصاغ بشكل صحيح</li>
    <li>تتعرف على إجراءات مرحلة التطوير فى النموذج العام ADDIE</li>
    <li>تحدد إجراءات مرحلة التنفيذ فى النموذج العام ADDIE</li>
    <li>تتعرف على إجراءات مرحلة التقويم فى النموذج العام ADDIE</li>
    <li>تطبق معايير تقييم  الواقع المعزز في مجال تخصصك</li>
  </ol>
  <div>
    <strong>الأهداف الأدائية:</strong>
    <ul>
      <li>تحدد الحاجات التعليمية: أى تحديد المشكلة التي تتطلب تطوير الواقع المعزز.</li>
      <li>تحدد الأهداف العامة  للواقع المعزز.</li>
      <li>تختار عنوان للواقع المعزز في ضوء الأهداف العامة</li>
      <li>تحدد خصائص المتعلمين: وهي الفئة المستهدفة من استخدام الواقع المعزز.</li>
      <li>تصيغ الأهداف التعليمية للواقع المعزز.</li>
      <li>تحدد محتوى الواقع المعزز.</li>
      <li>تقترح عدد من الوسائط المتعددة التي تتناسب مع العناصر السابقة للواقع المعزز.</li>
    </ul>
  </div>

  </>
)

export default unit_three
