const unit_one = (
  <>
    <u className='text-red text-bold text-large'>
      أهداف الموديول الأول : خلفية نظرية عن ماهية الواقع المعزز
    </u> 
    <div>
      <br />
      عزيزى الطالب / عزيزتى الطالبة
      <br />
      بعد الانتهاء من دراستك لهذا الموديول ينبغى أن تكون قادرًا على أن:
    </div>
    <ol>
      <li>يتعرف على مفهوم الواقع المعزز</li>
      <li> يتعرف على خصائص الواقع المعزز </li>
      <li> يميز بين خصائص الواقع المعزز</li>
      <li> يتعرف على أنواع الواقع المعزز </li>
      <li> يميز بين أنواع الواقع المعزز </li>
      <li> يتعرف على آلية عمل الواقع المعزز</li>
      <li> يميز بين مراحل آلية عمل الواقع المعزز</li>
      <li> يحدد أهمية توظيف الواقع المعزز في  العملية التعليمية.</li>
      <li> يتعرف على مكونات الواقع المعزز </li>
      <li> يميز بين مكونات الواقع المعزز</li>
    </ol>
  </>
)

export default unit_one
