const unit_four = (
  <>
  <u className='text-red text-bold text-large'>
    أهداف الموديول الرابع : تطوير الواقع المعزز باستخدام Assemblr Studio
  </u>
  <div>
    <br />
    عزيزى الطالب / عزيزتى الطالبة بعد الانتهاء من دراستك لهذا الموضوع ينبغى أن تكون قادرًا على أن:
  </div>
  <ol>
    <li>تتعرف على مميزات تطبيق Assemblr Studio</li>
    <li>تُعدد خصائص تطبيق Assemblr Studio</li>
    <li>تميز بين خصائص تطبيق Assemblr Studio</li>
  </ol>
  <div>
    <strong>الأهداف الأدائية:</strong>
    <ul>
      <li>تحمل تطبيق Assemblr Studio من متجر التطبيقات</li>
      <li>تسجل الدخول على موقع Assemblr Studio</li>
      <li>تنشئ مشروع جديد</li>
      <li>تضيف شكل ثلاثى الابعاد</li>
      <li>تحرك الشكل ثلاثى الابعاد فى الاتجاهات الثلاثة</li>
      <li>تكبر حجم الشكل ثلاثى الابعاد</li>
      <li>تضيف صورة في المشروع</li>
      <li>تضيف نصوص في المشروع</li>
      <li>تغير خلفية واجهه المشروع</li>
      <li>تضيف الموسيقى او المؤثرات الصوتية في المشروع</li>
      <li>تحفظ المشروع</li>
      <li>تعرض المشروع ثلاثى الابعاد فى الواقع الفعلى</li>
      <li>تضيف مشهد اخر للمشروع</li>
      <li>تنشر المشروع باستخدام Qr Code</li>
      <li>تشارك المشروع مع الزملاء</li>
      <li>تكتب عنوان للمشروع</li>
      <li>تعمل علامة مخصصة (custom AR maker لاظهار الواقع المعزز عليها)</li>
    </ul>
  </div>
  </>
)

export default unit_four
