const unit_two = (
  <>
    <u className='text-red text-bold text-large'>
      أهداف الموديول الثاني : تطبيقات الواقع المعزز و معايير تطويره
    </u> 
    <div>
      <br />
      عزيزى الطالب / عزيزتى الطالبة
      <br />
      بعد الانتهاء من دراستك لهذا الموديول ينبغى أن تكون قادرًا على أن:
    </div>
    <ol>
      <li>يتعرف على تطبيقات الواقع المعزز</li>
      <li> يميز بين تطبيقات الواقع المعزز</li>
      <li> يتعرف على مميزات كل تطبيق من تطبيقات الواقع المعزز</li>
      <li> يختار أحد تطبيقات الواقع المعزز الملائم لتخصصه </li>
      <li> يتعرف على  معايير تطوير الواقع المعزز</li>
      <li> يميز بين معايير تطوير الواقع المعزز</li>
      <li> يتعرف على شروط كل معيار من معايير تطوير الواقع المعزز</li>
      <li> يطبق معايير تطوير الواقع المعزز في مجال تخصصه </li>
    </ol>
  </>
)

export default unit_two
